blog-posts/2007-07-15-emacs-tidbit-dvi-and-latex-interaction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs tidbit: DVI and LaTeX interaction</title>
<!-- 2014-04-30 Wed 17:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Emacs tidbit: DVI and LaTeX interaction</h1>
<p>
July 15th, 2007 -
<a href="http://sachachua.com/blog/p/4292"><a href="http://sachachua.com/blog/p/4292">http://sachachua.com/blog/p/4292</a></a>
</p>

<p>
Skimming the help.gnu.emacs newsgroup can turn up all sorts of amazing
 tidbits. For example, I occasionally write papers using the LaTeX
 markup language for scientific documents. This allows me to produce
 professional-quality typeset papers, particularly when equations are
 involved. (I used that <b>so</b> many times in university!)
</p>

<p>
I just found out that you can click on the typeset document (the DVI)
 and jump to the source code. Here's what David wrote on help.gnu.emacs:
</p>

<blockquote>
<p>
That's easy. This feature is called forward and inverse search. It's
 explained in the AucTeX manual. If you use auctex just hit C-c C-t
C-s
 (I don't know if this also works within the build-in tex mode). This
 enables the TeX-source-specials. With the source-specials on, Emacs
 will start xdvi with further options. xdvi will start displaying the
 page where the point is set in Emacs (forward search). When you click
 any line in xdvi simultaneously pressing Ctrl you return to Emacs
with
 the point on the corresponding paragraph. This works also with other
 dvi viewers, but you have to configure them to use emacs server for
 inverse search.
</p>
</blockquote>

<p>
Wow.
</p>

<p>
On Technorati: <a href="http://www.technorati.com/tag/emacs">emacs</a>,
<a href="http://www.technorati.com/tag/pimpmyemacs">pimpmyemacs</a>
</p>

<p>
Random Emacs symbol: default-fringes-outside-margins &#x2013; Variable:
Default value of `fringes-outside-margins' for buffers that don't
override it.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
